TubaraoBrancoUTFPR/Acionamento/STM32F103-BLDC_v1.0/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_Board_Pin GPIO_PIN_13
#define LED_Board_GPIO_Port GPIOC
#define LIGA_DESLIGA_Pin GPIO_PIN_1
#define LIGA_DESLIGA_GPIO_Port GPIOA
#define HALL_W_Pin GPIO_PIN_1
#define HALL_W_GPIO_Port GPIOB
#define HALL_V_Pin GPIO_PIN_10
#define HALL_V_GPIO_Port GPIOB
#define HALL_U_Pin GPIO_PIN_11
#define HALL_U_GPIO_Port GPIOB
#define U_LOW_Pin GPIO_PIN_13
#define U_LOW_GPIO_Port GPIOB
#define V_LOW_Pin GPIO_PIN_14
#define V_LOW_GPIO_Port GPIOB
#define W_LOW_Pin GPIO_PIN_15
#define W_LOW_GPIO_Port GPIOB
#define PWM_U_H_Pin GPIO_PIN_8
#define PWM_U_H_GPIO_Port GPIOA
#define PWM_V_H_Pin GPIO_PIN_9
#define PWM_V_H_GPIO_Port GPIOA
#define PWM_W_H_Pin GPIO_PIN_10
#define PWM_W_H_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
